CreatePlaceholder Method
 Creates a placeholder sheet in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static ViewSheet CreatePlaceholder(
	Document aDoc
)
Visual Basic
Public Shared Function CreatePlaceholder ( _
	aDoc As Document _
) As ViewSheet
Visual C++
public:
static ViewSheet^ CreatePlaceholder(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DBDocument
 The document.
Return Value
 The placeholder sheet.
Remarks
 Placeholder sheets represent sheets stored outside of the Revit model, but which should be organized along with the Revit sheets.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →